"""
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
"""
# a
from itertools import count, cycle
import sys

s_arg = sys.argv

try:
    val = int(s_arg[1])
    for i in count(val):
        if i > 10 + val:
            break
        else:
            print(i, end=" ")
except ValueError:
    print("Parameter should be integer")





